Revit 2024 API
SpatialElement.Perimeter Property
The perimeter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Perimeter { get; }
Visual Basic
Public ReadOnly Property Perimeter As Double
	Get
Visual C++
public:
property double Perimeter {
	double get ();
}
See Also
SpatialElement Class
Autodesk.Revit.DB Namespace